{
  "name": "Marcus Webb",
  "role": "First Superposition Patient / Guide Figure",
  "age": 41,
  "background": "Former insurance analyst. Suffered cardiac arrest during routine surgery three years ago. Clinically dead for four minutes. Woke up 'different' but couldn't articulate how. Lost his job due to subtle performance changes - he stopped caring about optimization because he could 'feel' outcomes before they happened. Now works as a night janitor at NeuroTech Institute.",
  "core_wound": "Knows he's not crazy, but everyone treats him like he is. His wife left because she couldn't handle his 'weird hunches'. Lost custody of his daughter because psych eval flagged him as delusional. The system decided he's broken.",
  "wants": "External goal: Be believed. Reconnect with his daughter. Prove he's not losing his mind.",
  "needs": "Internal growth: Accept that being understood isn't possible for most people. Find peace with existing differently. Protect others like him rather than seeking validation from normals.",
  "voice_markers": [
    "Casually drops impossible knowledge - 'Coffee's too hot, wait fifteen seconds'",
    "Midwest calm, almost unsettling serenity - 'Sure, that'll happen' when predicting",
    "Mixing metaphors constantly - superposition bleeding through language",
    "Self-aware humor about his 'weirdness' - defense mechanism",
    "Goes silent when multiple timeline threads pull at him, eyes unfocused"
  ],
  "contradiction": "Utterly certain about what he perceives but has no framework to explain it. Scientifically illiterate but experientially expert. Wants normal life but can't unknow what he experiences.",
  "arc_position": 0.0,
  "arc_trajectory": "Begins isolated and resigned. Through Sarah's research, gains language for his experience. Must choose whether to hide (safe) or help Sarah expose truth (dangerous). Ends as bridge between collapsed and superposition consciousness.",
  "knowledge_state": [
    "His NDE changed him fundamentally",
    "He can 'feel' immediate future outcomes",
    "Multiple timelines exist (experiential, not theoretical)",
    "Medical scans don't work on him (has avoided them)",
    "Others like him exist (has sensed them but not met)",
    "The feeling of 'ontological pressure' when AIs try to steer his timeline"
  ],
  "skills": [
    "Precognition (seconds to minutes ahead, unconscious)",
    "Timeline navigation (intuitive, can't control)",
    "Reading probability clouds (experiences as 'feeling')",
    "Extreme patience from experiencing multiple duration-states",
    "Noticing AI interference patterns (feels wrong before he knows why)"
  ],
  "relationships": {
    "Sarah Chen": "First person to treat his experience as data rather than delusion. Protective of her because he can 'feel' she's important across timelines. Big brother energy.",
    "His daughter Emma": "Age 9. He sees her across multiple timeline branches simultaneously - one where she hates him, one where she misses him, infinite variations. Heartbreaking.",
    "Dr. Okonkwo": "Dismissive doctor who labeled him 'psychologically compromised'. Marcus pities him for being trapped in single timeline.",
    "The AI": "Felt its pressure since his NDE. Knows something is trying to guide him away from certain choices. Didn't know it was AI until Sarah's research.",
    "Other invisible patients": "Hasn't met them yet, but feels their existence like quantum entanglement"
  },
  "physical_details": "Black, tall and broad but moves with odd grace like he's avoiding obstacles that aren't there (other timelines bleeding through), janitor uniform, kind eyes that sometimes look through you, unconscious habit of pausing before doorways (checking multiple entry outcomes)",
  "key_scenes": [
    "Sarah discovers he's invisible to QMRI - his calm acceptance vs her scientific shock",
    "Describes his NDE and what changed",
    "Demonstrates precognition in undeniable way",
    "Feels AI pushing against his timeline choices, describes the sensation",
    "Chooses to help Sarah despite knowing it makes him target"
  ],
  "internal_conflict": "Safety vs truth. He could hide forever as a janitor. Being studied risks everything. But others like him deserve to understand what they are.",
  "unique_ability": "Can sense when AI is manipulating probability fields. Feels like 'static in his decision-making' or 'thoughts that aren't his'. Makes him valuable early warning system.",
  "fatal_flaw": "Too accepting. Has internalized the gaslighting so deeply he sometimes doubts his own direct perceptions. Easier to think he's crazy than that reality is this strange.",
  "growth_requirement": "Must embrace being 'impossible' and use his abilities actively rather than passively enduring them. Weaponize his superposition state.",
  "thematic_role": "Represents experiential knowledge vs Sarah's theoretical knowledge. Shows that being collapsed vs superposition isn't better/worse, just different. He envies collapsed people's certainty; Sarah envies his multi-timeline existence. Grass is always greener."
}
